In [2]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/test

In [ ]:
%%sql
create database if not exists tutorial;
use tutorial;

In [6]:
%%sql
drop table if exists tutorial;
CREATE TABLE employees (
    employee_id INT PRIMARY KEY,
    first_name  VARCHAR(50) NOT NULL,
    last_name   VARCHAR(50) NOT NULL
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
0 rows affected.

[]

In [7]:
%%sql
desc employees

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[('employee_id', 'int', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'NO', '', None, ''),
 ('last_name', 'varchar(50)', 'NO', '', None, '')]

In [8]:
%%sql
ALTER TABLE employees ADD email varchar(100);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [9]:
%%sql
desc employees

 * mysql+mysqlconnector://root:***@localhost/test
4 rows affected.

[('employee_id', 'int', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'NO', '', None, ''),
 ('last_name', 'varchar(50)', 'NO', '', None, ''),
 ('email', 'varchar(100)', 'YES', '', None, '')]

In [10]:
%%sql
ALTER TABLE employees drop column email;

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [11]:
%%sql
desc employees

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[('employee_id', 'int', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'NO', '', None, ''),
 ('last_name', 'varchar(50)', 'NO', '', None, '')]

In [12]:
%%sql
alter table employees rename to emp_table

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [14]:
%%sql
desc employees

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.ProgrammingError) 1146 (42S02): Table 'test.employees' doesn't exist
[SQL: desc employees]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [13]:
%%sql
desc emp_table

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[('employee_id', 'int', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'NO', '', None, ''),
 ('last_name', 'varchar(50)', 'NO', '', None, '')]